# Используем официальный образ Python как базовый образ
FROM python:3.9

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем файл зависимостей в рабочую директорию
COPY requirements.txt .

# Устанавливаем зависимости из файла requirements.txt
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальную часть исходного кода проекта в рабочую директорию
COPY . .

# Определяем команду для запуска при старте контейнера.
# Предполагается, что скрипт для инференса называется "predict.py"
CMD ["python", "./src/predict_model.py"]
